app/controllers/home_controller.rb

  def index
    @brews = []
    Product.all.each do |product|
---
SELECT "products".* FROM "products"