app/controllers/products_controller.rb

  def show
    @brews = @product.brew.all.order('date DESC').limit(5)
    @sales = @product.sale.all.where(paid: TRUE).order('date DESC').limit(5)
---
SELECT  "brews".* FROM "brews" WHERE "brews"."product_id" = $1 ORDER BY date DESC LIMIT $2  [["product_id", 1], ["LIMIT", 5]]
SELECT  "sales".* FROM "sales" WHERE "sales"."product_id" = $1 AND "sales"."paid" = $2 ORDER BY date DESC LIMIT $3  [["product_id", 1], ["paid", "t"], ["LIMIT", 5]]