app/views/sales/_form.html.erb

      <%= f.label :product_id %>
      <%= f.select :product_id, Product.all.map {|p| [p.name, p.id]} %>
---
SELECT "products".* FROM "products"